In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3  = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [4]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
states

['California', 'Ohio', 'Oregon', 'Texas']

In [5]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [6]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [7]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [8]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [9]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [10]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [12]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [13]:
obj3 == obj4

ValueError: Can only compare identically-labeled Series objects

In [14]:
obj3.isnull() == obj4.isnull()

ValueError: Can only compare identically-labeled Series objects

In [15]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [16]:
obj

NameError: name 'obj' is not defined

In [17]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [18]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [19]:
data = {'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year'  : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'   : [1.5, 1, 2, 3.0, 5, 6]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.0
2    Ohio  2002  2.0
3  Nevada  2001  3.0
4  Nevada  2002  5.0
5  Nevada  2003  6.0

In [21]:
datat = {'state': ['CA', 'NY'],
         'code' : [1, 2]}
framet = pd.DataFrame(datat)
framet

  state  code
0    CA     1
1    NY     2

In [22]:
datat  = [1, 2, 3]
framet = pd.DataFrame(datat)
framet

   0
0  1
1  2
2  3

In [25]:
indeks = ['hello']
framet.index.name = indeks
framet

         0
[hello]
0        1
1        2
2        3

In [26]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.0

In [27]:
frame.tail(3)

    state  year  pop
3  Nevada  2001  3.0
4  Nevada  2002  5.0
5  Nevada  2003  6.0

In [28]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.0
2  2002    Ohio  2.0
3  2001  Nevada  3.0
4  2002  Nevada  5.0
5  2003  Nevada  6.0

In [29]:
cols   = ['year', 'state', 'pop', 'debt']
index  = ['one', 'two', 'three', 'four', 'five', 'six']
frame2 = pd.DataFrame(data, columns=cols, index=index)
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.0  NaN
three  2002    Ohio  2.0  NaN
four   2001  Nevada  3.0  NaN
five   2002  Nevada  5.0  NaN
six    2003  Nevada  6.0  NaN

In [33]:
x, *rest = frame2.columns
x

'year'

In [34]:
frame[x]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [35]:
np.unique(frame[x])

array([2000, 2001, 2002, 2003])

In [36]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.0  NaN
three  2002    Ohio  2.0  NaN
four   2001  Nevada  3.0  NaN
five   2002  Nevada  5.0  NaN
six    2003  Nevada  6.0  NaN

In [39]:
frame2.loc['three']

year     2002
state    Ohio
pop         2
debt      NaN
Name: three, dtype: object

In [40]:
frame2.debt = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.0  16.5
three  2002    Ohio  2.0  16.5
four   2001  Nevada  3.0  16.5
five   2002  Nevada  5.0  16.5
six    2003  Nevada  6.0  16.5

In [42]:
frame2.loc['two']['state']

'Ohio'

In [43]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.0   1.0
three  2002    Ohio  2.0   2.0
four   2001  Nevada  3.0   3.0
five   2002  Nevada  5.0   4.0
six    2003  Nevada  6.0   5.0

In [44]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [45]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.0  -1.2
three  2002    Ohio  2.0   NaN
four   2001  Nevada  3.0  -1.5
five   2002  Nevada  5.0  -1.7
six    2003  Nevada  6.0   NaN

In [46]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.0  -1.2     True
three  2002    Ohio  2.0   NaN     True
four   2001  Nevada  3.0  -1.5    False
five   2002  Nevada  5.0  -1.7    False
six    2003  Nevada  6.0   NaN    False

In [47]:
del frame2['eastern']

In [48]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.0  -1.2
three  2002    Ohio  2.0   NaN
four   2001  Nevada  3.0  -1.5
five   2002  Nevada  5.0  -1.7
six    2003  Nevada  6.0   NaN

In [51]:
pop = {'Nevada': {2001: 2.4,
                  2002: 2.9},
       'Ohio'  : {2000: 1.5,
                  2001: 1.7,
                  2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [52]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [53]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [54]:
index = [2001, 2002, 2003]
pd.DataFrame(pop, index=index)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [55]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [56]:
frame3.index.name   = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [57]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [58]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.0, -1.2],
       [2002, 'Ohio', 2.0, nan],
       [2001, 'Nevada', 3.0, -1.5],
       [2002, 'Nevada', 5.0, -1.7],
       [2003, 'Nevada', 6.0, nan]], dtype=object)

##Index objects

In [59]:
index = ['a', 'b', 'c']
obj = pd.Series(range(3), index=index)
obj

a    0
b    1
c    2
dtype: int64

In [60]:
indeks = obj.index
indeks

Index(['a', 'b', 'c'], dtype='object')

In [61]:
indeks[1:]

Index(['b', 'c'], dtype='object')

In [62]:
indeks[1] = 'd'

TypeError: Index does not support mutable operations

In [63]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [64]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [65]:
obj2.index is labels

True

In [66]:
obj2.index == labels

array([ True,  True,  True])

In [67]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [68]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [69]:
'Ohio' in frame3.columns

True

In [70]:
2010 in frame3.index

False

In [72]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [ ]:
# Essential Functionality

In [73]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [75]:
new_index = ['a',  'b', 'c', 'd', 'e']
obj2 = obj.reindex(new_index)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [76]:
dat3 = ['blue', 'purple', 'yellow']
ind3 = [0, 2, 4]
obj3 = pd.Series(dat3, index=ind3)
obj3

0      blue
2    purple
4    yellow
dtype: object

In [77]:
rind3 = range(6)
obj3.reindex(rind3, method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [78]:
dat4  = np.arange(9).reshape((3, 3))
ind4  = ['a', 'c', 'd']
col4  = ['Ohio', 'Texas', 'California']
frame = pd.DataFrame(dat4, index=ind4, columns=col4)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [79]:
rind4  = ['a', 'b', 'c', 'd']
frame2 = frame.reindex(rind4)
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [80]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [81]:
frame.loc[['a', 'b', 'c', 'd'], states]

/Users/mkamaal/Workarea/MachineLearning/HandsOnMLSCTF/chapter2/env/lib/python3.7/site-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [83]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [84]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [85]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [86]:
index = ['Ohio', 'Colorado', 'Utah', "New York"]
col   = ['one', 'two', 'three', 'four']
dta   = np.arange(16).reshape((4, 4))
data  = pd.DataFrame(dta, index=index, columns=col)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [87]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [88]:
data.drop(['two'], axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [89]:
data.drop('two', axis=2)

ValueError: No axis named 2 for object type <class 'type'>

In [ ]:
## Indexing, selection, filtering

In [91]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [92]:
obj['b']

1.0

In [93]:
obj[1]

1.0

In [94]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [95]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [96]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [97]:
obj[obj > 2]

d    3.0
dtype: float64

In [98]:
condition = obj > 2
obj[condition]

d    3.0
dtype: float64

In [99]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [100]:
obj['b':'c'] = 5

In [101]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [102]:
dat   = np.arange(16).reshape((4, 4))
index = ['Ohio', 'Colorado', 'Utah', 'New York']
cols  = ['one', 'two', 'three', 'four']

data  = pd.DataFrame(dat, index=index, columns=cols)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [104]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [105]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [106]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [108]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
pd

In [110]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [111]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [112]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [113]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [114]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [115]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [116]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [117]:
ser[-1]

KeyError: -1

In [118]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

        What is this?

In [119]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [120]:
ser2[-1]

2.0

In [121]:
ser[:1]

0    0.0
dtype: float64

In [122]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [123]:
ser.iloc[:1]

0    0.0
dtype: float64

In [125]:
dat = [7.3, -2.5, 3.4, 1.5]
ind = ['a', 'c', 'd', 'e']
s1  = pd.Series(dat, index=ind)

dat1 = [-2.1, 3.6, -1.5, 4, 3.1]
ind2 = ['a', 'c', 'e', 'f', 'g']
s2   = pd.Series(dat1, index=ind2)

s1;s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [126]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [129]:
dat1 = np.arange(9.).reshape((3, 3))
dat2 = np.arange(12.).reshape((4, 3))

col1 = list('bcd')
col2 = list('bde')

ind1 = ["Ohio", "Texas", "Colorado"]
ind2 = ["Utah", "Ohio", "Texas", "Oregon"]

df1  = pd.DataFrame(dat1, columns=col1, index=ind1)
df2  = pd.DataFrame(dat2, columns=col2, index=ind2)

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [130]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [131]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [132]:
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

   A
0  1
1  2

In [133]:
df2

   B
0  3
1  4

In [134]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [135]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [136]:
dat1 = np.arange(12.).reshape(3, 4)
dat2 = np.arange(20.).reshape(4, 5)

col1 = list('abcd')
col2 = list('abcde')

df1  = pd.DataFrame(dat1, columns=col1)
df2  = pd.DataFrame(dat2, columns=col2)

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [137]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [141]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e  (1, b)
0   0.0   1.0   2.0   3.0   4.0     NaN
1   5.0   NaN   7.0   8.0   9.0     NaN
2  10.0  11.0  12.0  13.0  14.0     NaN
3  15.0  16.0  17.0  18.0  19.0     NaN

In [142]:
df1 + df2

   (1, b)     a     b     c     d   e
0     NaN   0.0   2.0   4.0   6.0 NaN
1     NaN   9.0   NaN  13.0  15.0 NaN
2     NaN  18.0  20.0  22.0  24.0 NaN
3     NaN   NaN   NaN   NaN   NaN NaN

In [144]:
df1.add(df2, fill_value=0)

   (1, b)     a     b     c     d     e
0     NaN   0.0   2.0   4.0   6.0   4.0
1     NaN   9.0   5.0  13.0  15.0   9.0
2     NaN  18.0  20.0  22.0  24.0  14.0
3     NaN  15.0  16.0  17.0  18.0  19.0

In [145]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [146]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [147]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e  (1, b)
0  0.0  1.0   2.0   3.0  0       0
1  4.0  5.0   6.0   7.0  0       0
2  8.0  9.0  10.0  11.0  0       0

In [148]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [149]:
arr[0]

array([0., 1., 2., 3.])

In [150]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [151]:
dat = np.arange(12.).reshape((4, 3))
col = list('bde')
ind = ['Utah', 'Ohio', 'Texas', 'Oregon']

frame = pd.DataFrame(dat, columns=col, index=ind)
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [152]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [153]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [155]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [156]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [157]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [158]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [159]:
#######

dat = np.random.randn(4, 3)
col = list('bde')
ind = ['Utah', 'Ohio', 'Texas', 'Oregon']

frame = pd.DataFrame(dat, columns=col, index=ind)
frame

               b         d         e
Utah    0.146006  0.333326  0.380384
Ohio    1.553876 -0.315749  1.373486
Texas   1.679261 -0.363221  0.385298
Oregon  0.030277  0.283831 -0.493889

In [160]:
np.abs(frame)

               b         d         e
Utah    0.146006  0.333326  0.380384
Ohio    1.553876  0.315749  1.373486
Texas   1.679261  0.363221  0.385298
Oregon  0.030277  0.283831  0.493889

In [161]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.648983
d    0.696547
e    1.867375
dtype: float64

In [162]:
frame.apply(f, axis='columns')

Utah      0.234378
Ohio      1.869625
Texas     2.042482
Oregon    0.777720
dtype: float64

In [163]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f)

            b         d         e
min  0.030277 -0.363221 -0.493889
max  1.679261  0.333326  1.373486

In [164]:
format = lambda x: '%.2f' % x

frame.applymap(format)

           b      d      e
Utah    0.15   0.33   0.38
Ohio    1.55  -0.32   1.37
Texas   1.68  -0.36   0.39
Oregon  0.03   0.28  -0.49

In [165]:
frame['e'].map(format)

Utah       0.38
Ohio       1.37
Texas      0.39
Oregon    -0.49
Name: e, dtype: object

In [166]:
dat = range(4)
ind = ['d', 'a', 'b', 'c']
obj = pd.Series(dat, index=ind)
obj

d    0
a    1
b    2
c    3
dtype: int64

In [167]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [169]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [170]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [171]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [172]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [174]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [175]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [176]:
frame = pd.DataFrame({'b': [4, 7, -3, 2],
                      'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [177]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [178]:
frame.sort_values(by='b', ascending=False)

   b  a
1  7  1
0  4  0
3  2  1
2 -3  0

In [179]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [180]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [181]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [2]:
import pandas_datareader.data as web

In [3]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.478571   30.080000   30.447144   30.104286   88102700.0
 2010-01-04   30.642857   30.340000   30.490000   30.572857  123432400.0
 2010-01-05   30.798571   30.464285   30.657143   30.625713  150476200.0
 2010-01-06   30.747143   30.107143   30.625713   30.138571  138040000.0
 2010-01-07   30.285715   29.864286   30.250000   30.082857  119282800.0
 2010-01-08   30.285715   29.865715   30.042856   30.282858  111902700.0
 2010-01-11   30.428572   29.778572   30.400000   30.015715  115557400.0
 2010-01-12   29.967142   29.488571   29.884285   29.674286  148614900.0
 2010-01-13   30.132856   29.157143   29.695715   30.092857  151473000.0
 2010-01-14   30.065714   29.860001   30.015715   29.918571  108223500.0
 2010-01-15   30.228571   29.410000   30.132856   29.418571  148516900.0
 2010-01-19   30.741428   29.605715   29.761429   30.719999  182501900.0
 2010-01-20   30.792856   29.928572   30.701429   30.247143  153038200.0
 2010-01-21   30.472857   29.601429   30.297142   29.724285  152038600.0
 2010-01-22   29.642857   28.165714   29.540001   28.250000  220441900.0
 2010-01-25   29.242857   28.598572   28.930000   29.010000  266424900.0
 2010-01-26   30.530001   28.940001   29.421429   29.420000  466777500.0
 2010-01-27   30.082857   28.504286   29.549999   29.697144  430642100.0
 2010-01-28   29.357143   28.385714   29.275715   28.469999  293375600.0
 2010-01-29   28.885714   27.178572   28.725714   27.437143  311488100.0
 2010-02-01   28.000000   27.328571   27.481428   27.818571  187469100.0
 2010-02-02   28.045713   27.625713   27.987143   27.980000  174585600.0
 2010-02-03   28.600000   27.774286   27.881428   28.461428  153832000.0
 2010-02-04   28.338572   27.367144   28.104286   27.435715  189413000.0
 2010-02-05   28.000000   27.264286   27.518572   27.922857  212576700.0
 2010-02-08   28.268572   27.714285   27.955715   27.731428  119567700.0
 2010-02-09   28.214285   27.821428   28.059999   28.027143  158221700.0
 2010-02-10   28.085714   27.751429   27.984285   27.874287   92590400.0
 2010-02-11   28.535715   27.722857   27.840000   28.381428  137586400.0
 2010-02-12   28.805714   27.928572   28.301428   28.625713  163867200.0
 ...                ...         ...         ...         ...          ...
 2019-02-08  170.660004  168.419998  168.990005  170.410004   23820000.0
 2019-02-11  171.210007  169.250000  171.050003  169.429993   20993400.0
 2019-02-12  171.000000  169.699997  170.100006  170.889999   22283500.0
 2019-02-13  172.479996  169.919998  171.389999  170.179993   22490200.0
 2019-02-14  171.259995  169.380005  169.710007  170.800003   21835700.0
 2019-02-15  171.699997  169.750000  171.250000  170.419998   24626800.0
 2019-02-19  171.440002  169.490005  169.710007  170.929993   18972800.0
 2019-02-20  173.320007  170.990005  171.190002  172.029999   26114400.0
 2019-02-21  172.369995  170.300003  171.800003  171.059998   17249700.0
 2019-02-22  173.000000  171.380005  171.580002  172.970001   18913200.0
 2019-02-25  175.869995  173.949997  174.160004  174.229996   21873400.0
 2019-02-26  175.300003  173.169998  173.710007  174.330002   17070200.0
 2019-02-27  175.000000  172.729996  173.210007  174.869995   27835400.0
 2019-02-28  174.910004  172.919998  174.320007  173.149994   28215400.0
 2019-03-01  175.149994  172.889999  174.279999  174.970001   25886200.0
 2019-03-04  177.750000  173.970001  175.690002  175.850006   27436200.0
 2019-03-05  176.000000  174.539993  175.940002  175.529999   19737400.0
 2019-03-06  175.490005  173.940002  174.669998  174.520004   20810400.0
 2019-03-07  174.440002  172.020004  173.869995  172.500000   24796400.0
 2019-03-08  173.070007  169.500000  170.320007  172.910004   23999400.0
 2019-03-11  179.119995  175.350006  175.490005  178.899994   32011000.0
 2019-03-12  182.669998  179.369995  180.000000  180.910004   32467600.0
 2019-03-13  183.300003  180.919998  182.250000  181.710007   31032500.0
 2019-03-14  184.100006  182.559998  183.899994  183.729996   23579500.0
 2019-03-15  187.330002  183.740005  184.850006  186.119995   39042900.0
 2019-03-18  188.389999  185.789993  185.800003  188.020004   26219800.0
 2019-03-19  188.990005  185.919998  188.350006  186.529999   31646400.0
 2019-03-20  189.490005  184.729996  186.229996  188.160004   31035200.0
 2019-03-21  196.330002  189.809998  190.020004  195.089996   50980100.0
 2019-03-22  196.970001  194.794998  195.339996  196.960007    2677868.0

              Adj Close
 Date
 2009-12-31   20.073631
 2010-01-04   20.386072
 2010-01-05   20.421322
 2010-01-06   20.096491
 2010-01-07   20.059338
 2010-01-08   20.192701
 2010-01-11   20.014568
 2010-01-12   19.786903
 2010-01-13   20.066006
 2010-01-14   19.949797
 2010-01-15   19.616390
 2010-01-19   20.484186
 2010-01-20   20.168890
 2010-01-21   19.820242
 2010-01-22   18.837185
 2010-01-25   19.343958
 2010-01-26   19.617346
 2010-01-27   19.802147
 2010-01-28   18.983883
 2010-01-29   18.295170
 2010-02-01   18.549507
 2010-02-02   18.657150
 2010-02-03   18.978167
 2010-02-04   18.294220
 2010-02-05   18.619045
 2010-02-08   18.491404
 2010-02-09   18.688580
 2010-02-10   18.586657
 2010-02-11   18.924822
 2010-02-12   19.087709
 ...                ...
 2019-02-08  170.410004
 2019-02-11  169.429993
 2019-02-12  170.889999
 2019-02-13  170.179993
 2019-02-14  170.800003
 2019-02-15  170.419998
 2019-02-19  170.929993
 2019-02-20  172.029999
 2019-02-21  171.059998
 2019-02-22  172.970001
 2019-02-25  174.229996
 2019-02-26  174.330002
 2019-02-27  174.869995
 2019-02-28  173.149994
 2019-03-01  174.970001
 2019-03-04  175.850006
 2019-03-05  175.529999
 2019-03-06  174.520004
 2019-03-07  172.500000
 2019-03-08  172.910004
 2019-03-11  178.899994
 2019-03-12  180.910004
 2019-03-13  181.710007
 2019-03-14  183.729996
 2019-03-15  186.119995
 2019-03-18  188.020004
 2019-03-19  186.529999
 2019-03-20  188.160004
 2019-03-21  195.089996
 2019-03-22  196.960007

 [2321 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0
 2010-01-04  132.970001  130.850006  131.179993  132.449997   6155300.0
 2010-01-05  131.850006  130.100006  131.679993  130.850006   6841400.0
 2010-01-06  131.490005  129.809998  130.679993  130.000000   5605300.0
 2010-01-07  130.250000  128.910004  129.869995  129.550003   5840600.0
 2010-01-08  130.919998  129.050003  129.070007  130.850006   4197200.0
 2010-01-11  131.059998  128.669998  131.059998  129.479996   5730400.0
 2010-01-12  131.330002  129.000000  129.029999  130.509995   8081500.0
 2010-01-13  131.119995  129.160004  130.389999  130.229996   6455400.0
 2010-01-14  132.710007  129.910004  130.550003  132.309998   7111800.0
 2010-01-15  132.889999  131.089996  132.029999  131.779999   8494400.0
 2010-01-19  134.250000  131.559998  131.630005  134.139999  13916200.0
 2010-01-20  131.149994  128.949997  130.460007  130.250000  15197500.0
 2010-01-21  130.690002  128.059998  130.470001  129.000000   9608600.0
 2010-01-22  128.889999  125.370003  128.669998  125.500000  10088600.0
 2010-01-25  126.889999  125.709999  126.330002  126.120003   5738500.0
 2010-01-26  127.750000  125.410004  125.919998  125.750000   7135300.0
 2010-01-27  126.959999  125.040001  125.820000  126.330002   8719200.0
 2010-01-28  127.040001  123.050003  127.029999  123.750000   9622200.0
 2010-01-29  125.000000  121.900002  124.320000  122.389999  11571200.0
 2010-02-01  124.949997  122.779999  123.230003  124.669998   7242900.0
 2010-02-02  125.809998  123.949997  124.790001  125.529999   5899900.0
 2010-02-03  126.070000  125.070000  125.160004  125.660004   4177100.0
 2010-02-04  125.440002  122.900002  125.190002  123.000000   9126900.0
 2010-02-05  123.720001  121.830002  123.040001  123.519997   8617000.0
 2010-02-08  123.220001  121.739998  123.150002  121.879997   5718500.0
 2010-02-09  124.199997  122.459999  122.650002  123.209999   6044500.0
 2010-02-10  123.650002  122.209999  122.940002  122.809998   5219100.0
 2010-02-11  124.199997  122.059998  122.580002  123.730003   5089000.0
 2010-02-12  124.050003  121.610001  123.010002  124.000000   8017700.0
 ...                ...         ...         ...         ...         ...
 2019-02-08  133.710007  132.190002  132.339996  133.710007   3249800.0
 2019-02-11  135.149994  133.910004  134.289993  133.990005   3095100.0
 2019-02-12  136.199997  134.860001  135.149994  136.050003   3317200.0
 2019-02-13  137.919998  136.410004  136.919998  137.520004   4253000.0
 2019-02-14  137.600006  136.210007  137.169998  136.479996   2789400.0
 2019-02-15  138.190002  137.389999  137.580002  138.029999   3844100.0
 2019-02-19  138.699997  137.360001  137.809998  138.699997   3385700.0
 2019-02-20  139.240005  137.220001  138.759995  138.000000   3802000.0
 2019-02-21  138.350006  137.350006  137.820007  137.839996   2937300.0
 2019-02-22  139.380005  138.429993  138.729996  139.250000   3113700.0
 2019-02-25  140.470001  139.320007  140.000000  139.460007   3194200.0
 2019-02-26  140.490005  139.470001  139.669998  139.720001   3060400.0
 2019-02-27  139.570007  138.399994  139.250000  139.169998   2530900.0
 2019-02-28  139.059998  137.720001  138.770004  138.130005   3457800.0
 2019-03-01  140.039993  138.639999  139.309998  139.199997   3030000.0
 2019-03-04  140.080002  137.169998  139.990005  138.429993   3406900.0
 2019-03-05  138.740005  137.559998  138.369995  137.880005   4250300.0
 2019-03-06  138.389999  136.720001  138.119995  136.979996   2768300.0
 2019-03-07  136.889999  134.630005  136.610001  135.360001   4358800.0
 2019-03-08  135.240005  133.580002  134.210007  135.089996   3773600.0
 2019-03-11  137.729996  135.839996  136.029999  137.710007   3939300.0
 2019-03-12  139.699997  137.860001  138.520004  138.279999   3954700.0
 2019-03-13  139.320007  137.850006  138.050003  138.559998   3173200.0
 2019-03-14  138.940002  138.059998  138.509995  138.789993   2738600.0
 2019-03-15  140.330002  139.229996  139.369995  139.429993   7153700.0
 2019-03-18  140.369995  138.720001  139.830002  140.210007   3268500.0
 2019-03-19  141.699997  140.000000  140.960007  140.490005   3482300.0
 2019-03-20  140.699997  138.979996  140.529999  139.600006   3649500.0
 2019-03-21  142.119995  138.880005  139.100006  141.440002   3577200.0
 2019-03-22  141.440002  140.899994  139.100006  141.440002     92342.0

              Adj Close
 Date
 2009-12-31   99.303009
 2010-01-04  100.478867
 2010-01-05   99.265091
 2010-01-06   98.620255
 2010-01-07   98.278870
 2010-01-08   99.265091
 2010-01-11   98.225777
 2010-01-12   99.007156
 2010-01-13   98.794746
 2010-01-14  100.372673
 2010-01-15   99.970589
 2010-01-19  101.760918
 2010-01-20   98.809929
 2010-01-21   97.861649
 2010-01-22   95.206505
 2010-01-25   95.676834
 2010-01-26   95.396156
 2010-01-27   95.836143
 2010-01-28   93.878906
 2010-01-29   92.847176
 2010-02-01   94.576828
 2010-02-02   95.229240
 2010-02-03   95.327866
 2010-02-04   93.309929
 2010-02-05   93.704422
 2010-02-08   92.873825
 2010-02-09   93.887291
 2010-02-10   93.582497
 2010-02-11   94.283569
 2010-02-12   94.489265
 ...                ...
 2019-02-08  133.710007
 2019-02-11  133.990005
 2019-02-12  136.050003
 2019-02-13  137.520004
 2019-02-14  136.479996
 2019-02-15  138.029999
 2019-02-19  138.699997
 2019-02-20  138.000000
 2019-02-21  137.839996
 2019-02-22  139.250000
 2019-02-25  139.460007
 2019-02-26  139.720001
 2019-02-27  139.169998
 2019-02-28  138.130005
 2019-03-01  139.199997
 2019-03-04  138.429993
 2019-03-05  137.880005
 2019-03-06  136.979996
 2019-03-07  135.360001
 2019-03-08  135.089996
 2019-03-11  137.710007
 2019-03-12  138.279999
 2019-03-13  138.559998
 2019-03-14  138.789993
 2019-03-15  139.429993
 2019-03-18  140.210007
 2019-03-19  140.490005
 2019-03-20  139.600006
 2019-03-21  141.440002
 2019-03-22  141.440002

 [2321 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close       Volume  \
 Date
 2009-12-31   30.990000   30.480000   30.980000   30.480000   31929700.0
 2010-01-04   31.100000   30.590000   30.620001   30.950001   38409100.0
 2010-01-05   31.100000   30.639999   30.850000   30.959999   49749600.0
 2010-01-06   31.080000   30.520000   30.879999   30.770000   58182400.0
 2010-01-07   30.700001   30.190001   30.629999   30.450001   50559700.0
 2010-01-08   30.879999   30.240000   30.280001   30.660000   51197400.0
 2010-01-11   30.760000   30.120001   30.709999   30.270000   68754700.0
 2010-01-12   30.400000   29.910000   30.150000   30.070000   65912100.0
 2010-01-13   30.520000   30.010000   30.260000   30.350000   51863500.0
 2010-01-14   31.100000   30.260000   30.309999   30.959999   63228100.0
 2010-01-15   31.240000   30.709999   31.080000   30.860001   79913200.0
 2010-01-19   31.240000   30.680000   30.750000   31.100000   46575700.0
 2010-01-20   30.940001   30.309999   30.809999   30.590000   54849500.0
 2010-01-21   30.719999   30.000000   30.610001   30.010000   73086700.0
 2010-01-22   30.200001   28.840000   30.000000   28.959999  102004600.0
 2010-01-25   29.660000   29.100000   29.240000   29.320000   63373000.0
 2010-01-26   29.850000   29.090000   29.200001   29.500000   66639900.0
 2010-01-27   29.820000   29.020000   29.350000   29.670000   63949500.0
 2010-01-28   29.870001   28.889999   29.840000   29.160000  117513700.0
 2010-01-29   29.920000   27.660000   29.900000   28.180000  193888500.0
 2010-02-01   28.480000   27.920000   28.389999   28.410000   85931100.0
 2010-02-02   28.500000   28.139999   28.370001   28.459999   54413700.0
 2010-02-03   28.790001   28.120001   28.260000   28.629999   61397900.0
 2010-02-04   28.500000   27.809999   28.379999   27.840000   77850000.0
 2010-02-05   28.280001   27.570000   28.000000   28.020000   80960100.0
 2010-02-08   28.080000   27.570000   28.010000   27.719999   52820600.0
 2010-02-09   28.340000   27.750000   27.969999   28.010000   59195800.0
 2010-02-10   28.240000   27.840000   28.030001   27.990000   48591300.0
 2010-02-11   28.400000   27.700001   27.930000   28.120001   65993700.0
 2010-02-12   28.059999   27.580000   27.809999   27.930000   81117200.0
 ...                ...         ...         ...         ...          ...
 2019-02-08  105.779999  104.260002  104.389999  105.669998   21461100.0
 2019-02-11  106.580002  104.970001  106.199997  105.250000   18914100.0
 2019-02-12  107.139999  105.480003  106.139999  106.889999   25056600.0
 2019-02-13  107.779999  106.709999  107.500000  106.809998   18394900.0
 2019-02-14  107.290001  105.660004  106.309998  106.900002   21784700.0
 2019-02-15  108.300003  107.360001  107.910004  108.220001   26606900.0
 2019-02-19  108.660004  107.779999  107.790001  108.169998   18038500.0
 2019-02-20  107.940002  106.290001  107.860001  107.150002   21607700.0
 2019-02-21  109.480003  106.870003  106.900002  109.410004   29063200.0
 2019-02-22  111.199997  109.820000  110.050003  110.970001   27763200.0
 2019-02-25  112.180000  111.260002  111.760002  111.589996   23750600.0
 2019-02-26  113.239998  111.169998  111.260002  112.360001   21536700.0
 2019-02-27  112.360001  110.879997  111.690002  112.169998   21487100.0
 2019-02-28  112.879997  111.730003  112.040001  112.029999   29083900.0
 2019-03-01  113.019997  111.669998  112.889999  112.529999   23501200.0
 2019-03-04  113.250000  110.800003  113.019997  112.260002   26608000.0
 2019-03-05  112.389999  111.230003  112.250000  111.699997   19538300.0
 2019-03-06  112.660004  111.430000  111.870003  111.750000   17687000.0
 2019-03-07  111.550003  109.870003  111.400002  110.389999   25339000.0
 2019-03-08  110.709999  108.800003  109.160004  110.510002   22818400.0
 2019-03-11  112.949997  110.980003  110.989998  112.830002   26491600.0
 2019-03-12  113.989998  112.650002  112.820000  113.620003   26132700.0
 2019-03-13  115.000000  113.779999  114.129997  114.500000   35513800.0
 2019-03-14  115.199997  114.330002  114.540001  114.589996   30763400.0
 2019-03-15  117.250000  114.589996  115.339996  115.910004   54681100.0
 2019-03-18  117.610001  116.050003  116.169998  117.570000   31207600.0
 2019-03-19  118.440002  116.989998  118.089996  117.650002   37588700.0
 2019-03-20  118.750000  116.709999  117.389999  117.519997   28113300.0
 2019-03-21  120.820000  117.089996  117.139999  120.220001   29835600.0
 2019-03-22  119.588501  119.029999  119.500000  119.361000     979869.0

              Adj Close
 Date
 2009-12-31   24.241983
 2010-01-04   24.615801
 2010-01-05   24.623755
 2010-01-06   24.472631
 2010-01-07   24.218124
 2010-01-08   24.385145
 2010-01-11   24.074966
 2010-01-12   23.915895
 2010-01-13   24.138592
 2010-01-14   24.623755
 2010-01-15   24.544212
 2010-01-19   24.735104
 2010-01-20   24.329473
 2010-01-21   23.868181
 2010-01-22   23.033073
 2010-01-25   23.319397
 2010-01-26   23.462553
 2010-01-27   23.597769
 2010-01-28   23.192135
 2010-01-29   22.412704
 2010-02-01   22.595629
 2010-02-02   22.635405
 2010-02-03   22.770605
 2010-02-04   22.142290
 2010-02-05   22.285454
 2010-02-08   22.046848
 2010-02-09   22.277498
 2010-02-10   22.261591
 2010-02-11   22.364988
 2010-02-12   22.213871
 ...                ...
 2019-02-08  105.220634
 2019-02-11  104.802422
 2019-02-12  106.435448
 2019-02-13  106.355782
 2019-02-14  106.445404
 2019-02-15  107.759789
 2019-02-19  107.709999
 2019-02-20  107.150002
 2019-02-21  109.410004
 2019-02-22  110.970001
 2019-02-25  111.589996
 2019-02-26  112.360001
 2019-02-27  112.169998
 2019-02-28  112.029999
 2019-03-01  112.529999
 2019-03-04  112.260002
 2019-03-05  111.699997
 2019-03-06  111.750000
 2019-03-07  110.389999
 2019-03-08  110.510002
 2019-03-11  112.830002
 2019-03-12  113.620003
 2019-03-13  114.500000
 2019-03-14  114.589996
 2019-03-15  115.910004
 2019-03-18  117.570000
 2019-03-19  117.650002
 2019-03-20  117.519997
 2019-03-21  120.220001
 2019-03-22  119.361000

 [2321 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close      Volume  \
 Date
 2009-12-31   310.679321   307.986847   310.356445   307.986847   2455400.0
 2010-01-04   312.721039   310.103088   311.449310   311.349976   3937800.0
 2010-01-05   311.891449   308.761810   311.563568   309.978882   6048500.0
 2010-01-06   310.907837   301.220856   310.907837   302.164703   8009000.0
 2010-01-07   303.029083   294.410156   302.731018   295.130463  12912000.0
 2010-01-08   299.675903   292.651581   294.087250   299.064880   9509900.0
 2010-01-11   300.276978   295.100647   300.276978   298.612823  14519600.0
 2010-01-12   297.147339   292.100159   296.893982   293.332153   9769600.0
 2010-01-13   292.288940   285.095734   286.382355   291.648102  13077600.0
 2010-01-14   295.180145   289.521942   290.063416   293.019196   8535300.0
 2010-01-15   294.862213   287.152344   294.752930   288.126007  10939600.0
 2010-01-19   293.302338   286.283020   288.722137   291.911407   8689500.0
 2010-01-20   291.096710   285.786224   291.096710   288.329681   6543600.0
 2010-01-21   291.513977   284.276062   289.834900   289.606384  12697400.0
 2010-01-22   283.456390   265.701874   280.426086   273.227905  13689200.0
 2010-01-25   273.163330   266.024780   271.528961   268.255249   8897200.0
 2010-01-26   273.024231   266.412231   267.246826   269.457428   8767600.0
 2010-01-27   272.055542   265.925415   268.886169   269.298462   7980200.0
 2010-01-28   271.732635   263.585632   270.485748   265.418701   6500100.0
 2010-01-29   268.747070   261.106750   267.505127   263.257751   8334700.0
 2010-02-01   266.173798   263.436584   265.572693   264.787811   4530800.0
 2010-02-02   265.751556   262.100281   265.751556   263.843964   8245600.0
 2010-02-03   269.298462   262.408295   262.626862   268.662598   6037000.0

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in all_data.items()})

In [6]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-03-18  0.010209  0.005594  0.014321 -0.000169
2019-03-19 -0.007925  0.001997  0.000680  0.012320
2019-03-20  0.008739 -0.006335 -0.001105  0.020953
2019-03-21  0.036830  0.013180  0.022975  0.006185
2019-03-22  0.009585  0.000000 -0.007145 -0.003313

In [7]:
returns['MSFT'].corr(returns['IBM'])

0.4878053924781747

In [8]:
returns['MSFT'].cov(returns['IBM'])

8.723316717459547e-05

In [9]:
obj = pd.Series('c a d a a b b c c'.split())
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [10]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [11]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [12]:
pd.value_counts(obj.values, sort=False)

b    2
c    3
d    1
a    3
dtype: int64

In [13]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [14]:
mask = obj.isin('b c'.split())
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [ ]:
obj[mask]